xiaxiaoyu8/WeGUI-For-STM32F03C8T6/STM32F103/Oled_Port/stm32f103_lcd_hard_4spi_port.c
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}
#endif



//----------------------------RGB565屏幕刷屏接口-------------------------------------
#elif defined (LCD_USE_RGB565)

#if (LCD_MODE == _FULL_BUFF_FULL_UPDATE)
//---------方式1:全缓存全屏刷----------
uint8_t LCD_Refresh(void)
{
	uint16_t x,y;
	LCD_Set_Addr(0,0,SCREEN_WIDTH-1,SCREEN_HIGH-1);
	
	Set_SPI_DataSize_16b();
	LCD_DC_Set();
	LCD_CS_Clr();
	for(y=0;y<SCREEN_HIGH;y++)
	{
		for(x=0;x<SCREEN_WIDTH;x++)
		{
			if(lcd_driver.LCD_GRAM[y/8][x]&(0x01<<(y%8)))
			{
				//绘图色
				while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
				LCD_SPIx->DR = LCD_DRAW_COLOUR;
			}
			else
			{
				//背景色
				while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
				LCD_SPIx->DR = LCD_CLEAR_COLOUR;
			}
		}
	}
	while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
	while((LCD_SPIx->SR & SPI_I2S_FLAG_BSY) != (uint16_t)RESET);
	LCD_CS_Set();
	Set_SPI_DataSize_8b();
	return 0;
}

#elif (LCD_MODE == _FULL_BUFF_DYNA_UPDATE)
//---------方式2:全缓存动态刷----------
uint8_t LCD_Refresh(void)
{
	//每page做校验,若校验码没变,则不刷新该page
	static uint32_t sum1[GRAM_YPAGE_NUM];
	uint8_t ypage,ycount;
	uint16_t x;

	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint32_t i_sum1;

		//-----方式1:CRC算法校验-----
		CRC->CR = CRC_CR_RESET;//CRC_ResetDR();
		for(x=0;x<SCREEN_WIDTH;x++)
		{
			CRC->DR = lcd_driver.LCD_GRAM[ypage][x];//CRC_CalcCRC(lcd_driver.LCD_GRAM[ypage][x]);
		}
		i_sum1 = CRC->DR;//i_sum1 = CRC_GetCRC();
		//---------------------------

		if(sum1[ypage] != i_sum1)
		{
			uint8_t y=0;
			
			LCD_Set_Addr(0,ypage*8,SCREEN_WIDTH-1,SCREEN_HIGH-1);
			LCD_DC_Set();
			LCD_CS_Clr();
			Set_SPI_DataSize_16b();
			
			ycount = 8* ypage;
			for(y=0;y<8;y++)
			{
				uint8_t x,mask;
				if(++ycount >= SCREEN_HIGH){break;}
				mask=0x01<<(y%8);
				for(x=0;x<SCREEN_WIDTH;x++)
				{
					if(lcd_driver.LCD_GRAM[ypage][x]&mask)
					{
						//绘图色
						while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
						LCD_SPIx->DR = LCD_DRAW_COLOUR;
					}
					else
					{
						//背景色
						while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
						LCD_SPIx->DR = LCD_CLEAR_COLOUR;
					}
				}
			}
			
			while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
			while((LCD_SPIx->SR & SPI_I2S_FLAG_BSY) != (uint16_t)RESET);
			LCD_CS_Set();
			Set_SPI_DataSize_8b();
			sum1[ypage] = i_sum1;
		}
	}
	LCD_CS_Set();
	Set_SPI_DataSize_8b();
	return 0;
}
#elif (LCD_MODE == _PAGE_BUFF_FULL_UPDATE)
//---------方式3:页缓存全屏刷新----------
uint8_t LCD_Refresh(void)
{
	uint16_t x,y;
	LCD_Set_Addr(0,lcd_driver.lcd_refresh_ypage*8,SCREEN_WIDTH-1,SCREEN_HIGH-1);
	
	Set_SPI_DataSize_16b();
	LCD_DC_Set();
	LCD_CS_Clr();
	for(y=0;(y+lcd_driver.lcd_refresh_ypage*8)<SCREEN_HIGH;)
	{
		for(x=0;x<SCREEN_WIDTH;x++)
		{
			if(lcd_driver.LCD_GRAM[y/8][x]&(0x01<<(y%8)))
			{
				//绘图色
				while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
				LCD_SPIx->DR = LCD_DRAW_COLOUR;
			}
			else
			{
				//背景色
				while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
				LCD_SPIx->DR = LCD_CLEAR_COLOUR;
			}
		}
		y++;
		if(y>=(GRAM_YPAGE_NUM*8))
		{
			break;
		}
	}
	while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
	while((LCD_SPIx->SR & SPI_I2S_FLAG_BSY) != (uint16_t)RESET);
	LCD_CS_Set();
	Set_SPI_DataSize_8b();
	
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}
#elif (LCD_MODE == _PAGE_BUFF_DYNA_UPDATE)
//---------方式4:页缓存动态刷新----------
uint8_t LCD_Refresh(void)
{
	//每page做校验,若校验码没变,则不刷新该page
	static uint32_t crc[((SCREEN_HIGH+7)/8)];
	uint16_t ypage,ycount;
	uint16_t x;

	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint32_t i_crc;
		if((lcd_driver.lcd_refresh_ypage + ypage)>=((SCREEN_HIGH+7)/8))
		{
			break;
		}
		//-----方式1:CRC算法校验-----
		CRC->CR = CRC_CR_RESET;//CRC_ResetDR();
		for(x=0;x<SCREEN_WIDTH;x++)
		{
			CRC->DR = lcd_driver.LCD_GRAM[ypage][x];//CRC_CalcCRC(lcd_driver.LCD_GRAM[ypage][x]);
		}
		i_crc = CRC->DR;//i_sum1 = CRC_GetCRC();
		//---------------------------

		if(crc[lcd_driver.lcd_refresh_ypage + ypage] != i_crc)
		{
			uint8_t y=0;
			
			LCD_Set_Addr(0,(lcd_driver.lcd_refresh_ypage+ypage)*8,SCREEN_WIDTH-1,SCREEN_HIGH-1);
			LCD_DC_Set();
			LCD_CS_Clr();
			Set_SPI_DataSize_16b();
			
			ycount = 8* (ypage + lcd_driver.lcd_refresh_ypage);
			for(y=0;y<8;y++)
			{
				uint8_t x,mask;
				if(++ycount >= SCREEN_HIGH)
				{
					break;
				}
				mask=0x01<<(y%8);
				for(x=0;x<SCREEN_WIDTH;x++)
				{
					if(lcd_driver.LCD_GRAM[ypage][x]&mask)
					{
						//绘图色
						while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
						LCD_SPIx->DR = LCD_DRAW_COLOUR;
					}
					else
					{
						//背景色
						while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
						LCD_SPIx->DR = LCD_CLEAR_COLOUR;
					}
				}
			}
			crc[lcd_driver.lcd_refresh_ypage + ypage] = i_crc;
			while((LCD_SPIx->SR & SPI_I2S_FLAG_TXE) == (uint16_t)RESET);
			while((LCD_SPIx->SR & SPI_I2S_FLAG_BSY) != (uint16_t)RESET);
			LCD_CS_Set();
			Set_SPI_DataSize_8b();
		}
	}
	LCD_CS_Set();
	Set_SPI_DataSize_8b();
	
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}
#endif



#endif
#endif
